---
type: LinkElementId
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# LinkElementId

`Autodesk.Revit.DB.LinkElementId` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LinkElementId | — | `` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Property | HostElementId | 2012 | `public ElementId HostElementId { get ; }` |
| Property | LinkInstanceId | — | `public ElementId LinkInstanceId { get ; }` |
| Property | LinkedElementId | 2012 | `public ElementId LinkedElementId { get ; }` |